tests/raw-responses/invoice/invoice_list.json

{
  "invoices": [
    {
      "id": "915fc838-f2c6-46ec-be44-4a93c9500f5f",
      "status": "paid",
      "amount": 7000,
      "currency": "SAR",
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/915fc838-f2c6-46ec-be44-4a93c9500f5f?lang=en",
      "callback_url": "http://ptsv2.com/t/qf2ql-1562693762/post?orderid=1320",
      "expired_at": null,
      "created_at": "2019-07-09T17:37:45.940Z",
      "updated_at": "2019-07-09T17:38:15.706Z",
      "payment_id": "ae5e8c6a-1622-45a5-b7ca-9ead69be722e",
      "paid_at": "2019-07-09T17:38:11.050Z"
    },
    {
      "id": "739639b0-913b-408f-88f6-44affd547e7a",
      "status": "paid",
      "amount": 7000,
      "currency": "SAR",
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/739639b0-913b-408f-88f6-44affd547e7a?lang=en",
      "callback_url": "http://ptsv2.com/t/ck0rf-1562678677/post",
      "expired_at": null,
      "created_at": "2019-07-09T14:24:29.451Z",
      "updated_at": "2019-07-09T14:25:12.523Z",
      "payment_id": "e19918db-b042-4c39-b6e1-ae3f6498a0da",
      "paid_at": "2019-07-09T14:25:08.069Z"
    },
    {
      "id": "de5680b0-d3e8-4646-9af6-53d141c51575",
      "status": "paid",
      "amount": 7000,
      "currency": "SAR",
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/de5680b0-d3e8-4646-9af6-53d141c51575?lang=en",
      "callback_url": "http://ptsv2.com/t/ck0rf-1562678677/post",
      "expired_at": null,
      "created_at": "2019-07-09T13:25:24.089Z",
      "updated_at": "2019-07-09T13:26:26.249Z",
      "payment_id": "4af9e0f7-eda2-41eb-9979-9e1d6cca42ff",
      "paid_at": "2019-07-09T13:26:17.974Z"
    },
    {
      "id": "627aa8af-cad7-4f2c-b090-634c1c4de00e",
      "status": "paid",
      "amount": 1000,
      "currency": "SAR",
      "description": "Test Invoice",
      "amount_format": "10.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/627aa8af-cad7-4f2c-b090-634c1c4de00e?lang=en",
      "callback_url": "http://moyasar-invoice-test.us-east-2.elasticbeanstalk.com/invoices/process",
      "expired_at": null,
      "created_at": "2019-07-02T16:34:49.471Z",
      "updated_at": "2019-07-02T16:35:56.704Z",
      "payment_id": "e6b54aca-2882-4dc6-b771-237205e875ed",
      "paid_at": "2019-07-02T16:35:46.082Z"
    },
    {
      "id": "6b0a2730-f332-4b51-8bde-3e26e25c106c",
      "status": "initiated",
      "amount": 1000,
      "currency": "SAR",
      "description": "Meat Loaf",
      "amount_format": "10.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/6b0a2730-f332-4b51-8bde-3e26e25c106c?lang=en",
      "callback_url": "http://google.com/ncr",
      "expired_at": null,
      "created_at": "2019-07-02T12:25:21.002Z",
      "updated_at": "2019-07-02T12:25:21.002Z",
      "payment_id": null,
      "paid_at": null
    },
    {
      "id": "64a5fc6a-9361-48bd-8d96-0e63ef5d85ae",
      "status": "initiated",
      "amount": 1000,
      "currency": "SAR",
      "description": "Test Invoice\r\nKMKKKKKKKK",
      "amount_format": "10.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/64a5fc6a-9361-48bd-8d96-0e63ef5d85ae?lang=en",
      "callback_url": "http://moyasar-invoice-test.us-east-2.elasticbeanstalk.com/invoices/process",
      "expired_at": null,
      "created_at": "2019-05-21T21:41:22.990Z",
      "updated_at": "2019-05-21T21:41:22.990Z",
      "payment_id": null,
      "paid_at": null
    },
    {
      "id": "9ff40f62-2b08-412d-9980-c2bcd59ce9d1",
      "status": "initiated",
      "amount": 1000,
      "currency": "SAR",
      "description": "Test Invoice",
      "amount_format": "10.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/9ff40f62-2b08-412d-9980-c2bcd59ce9d1?lang=en",
      "callback_url": "http://moyasar-invoice-test.us-east-2.elasticbeanstalk.com/invoices/process",
      "expired_at": null,
      "created_at": "2019-05-20T21:41:57.454Z",
      "updated_at": "2019-05-20T21:41:57.454Z",
      "payment_id": null,
      "paid_at": null
    },
    {
      "id": "a1031e54-a812-4469-9569-8715d6d85cce",
      "status": "paid",
      "amount": 1000,
      "currency": "SAR",
      "description": "Test Invoice",
      "amount_format": "10.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/a1031e54-a812-4469-9569-8715d6d85cce?lang=en",
      "callback_url": "http://moyasar-invoice-test.us-east-2.elasticbeanstalk.com/invoices/process",
      "expired_at": null,
      "created_at": "2019-05-20T21:29:18.270Z",
      "updated_at": "2019-05-20T21:30:17.238Z",
      "payment_id": "7dd16219-fcc3-4396-abdf-79262baa72da",
      "paid_at": "2019-05-20T21:30:11.230Z"
    },
    {
      "id": "2d4f38b2-0545-4ede-b0a4-dffbb8a7b142",
      "status": "initiated",
      "amount": 500,
      "currency": "SAR",
      "description": "Test Invoice",
      "amount_format": "5.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/2d4f38b2-0545-4ede-b0a4-dffbb8a7b142?lang=en",
      "callback_url": "http://moyasar-invoice-test.us-east-2.elasticbeanstalk.com/invoices/process",
      "expired_at": null,
      "created_at": "2019-05-20T21:14:52.996Z",
      "updated_at": "2019-05-20T21:14:52.996Z",
      "payment_id": null,
      "paid_at": null
    },
    {
      "id": "0bb22109-2101-4e14-820d-3808898a109a",
      "status": "paid",
      "amount": 1000,
      "currency": "SAR",
      "description": "Test Invoice",
      "amount_format": "10.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/0bb22109-2101-4e14-820d-3808898a109a?lang=en",
      "callback_url": "http://moyasar-invoice-test.us-east-2.elasticbeanstalk.com/invoices/process",
      "expired_at": null,
      "created_at": "2019-05-20T21:12:08.809Z",
      "updated_at": "2019-05-20T21:13:09.897Z",
      "payment_id": "ae23fa05-5d5b-49c7-b152-94bc7e26db41",
      "paid_at": "2019-05-20T21:13:00.723Z"
    },
    {
      "id": "45ad519a-1b78-4304-adf7-544bdf6dccc7",
      "status": "initiated",
      "amount": 1000,
      "currency": "SAR",
      "description": "Test Invoice",
      "amount_format": "10.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/45ad519a-1b78-4304-adf7-544bdf6dccc7?lang=en",
      "callback_url": "http://127.0.0.1:8000/invoices/process",
      "expired_at": null,
      "created_at": "2019-05-20T20:50:23.310Z",
      "updated_at": "2019-05-20T20:50:23.310Z",
      "payment_id": null,
      "paid_at": null
    },
    {
      "id": "90bed7f6-8460-474b-9a9b-16064e619df4",
      "status": "canceled",
      "amount": 7000,
      "currency": "SAR",
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/90bed7f6-8460-474b-9a9b-16064e619df4?lang=en",
      "callback_url": "http://www.example.com/payment_callback",
      "expired_at": null,
      "created_at": "2019-02-07T07:23:39.120Z",
      "updated_at": "2019-02-07T07:27:16.041Z",
      "payment_id": null,
      "paid_at": null
    },
    {
      "id": "cb13db3a-4f08-409d-bc08-1ddb881f2334",
      "status": "initiated",
      "amount": 7000,
      "currency": "SAR",
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/cb13db3a-4f08-409d-bc08-1ddb881f2334?lang=en",
      "callback_url": "http://www.example.com/payment_callback",
      "expired_at": null,
      "created_at": "2019-01-27T15:14:16.892Z",
      "updated_at": "2019-01-27T15:14:16.892Z",
      "payment_id": null,
      "paid_at": null
    },
    {
      "id": "1a92e30b-8251-41da-9857-054844a66b07",
      "status": "initiated",
      "amount": 7000,
      "currency": "SAR",
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/1a92e30b-8251-41da-9857-054844a66b07?lang=en",
      "callback_url": "http://www.example.com/payment_callback",
      "expired_at": null,
      "created_at": "2019-01-27T15:14:16.113Z",
      "updated_at": "2019-01-27T15:14:16.113Z",
      "payment_id": null,
      "paid_at": null
    },
    {
      "id": "ff3f322b-19cc-413a-8913-466f1f4da649",
      "status": "initiated",
      "amount": 7000,
      "currency": "SAR",
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/ff3f322b-19cc-413a-8913-466f1f4da649?lang=en",
      "callback_url": "http://www.example.com/payment_callback",
      "expired_at": null,
      "created_at": "2019-01-27T15:14:15.337Z",
      "updated_at": "2019-01-27T15:14:15.337Z",
      "payment_id": null,
      "paid_at": null
    },
    {
      "id": "651a808e-4fc4-4c0e-ab8f-2ec014c26478",
      "status": "initiated",
      "amount": 7000,
      "currency": "SAR",
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/651a808e-4fc4-4c0e-ab8f-2ec014c26478?lang=en",
      "callback_url": "http://www.example.com/payment_callback",
      "expired_at": null,
      "created_at": "2019-01-27T15:14:14.552Z",
      "updated_at": "2019-01-27T15:14:14.552Z",
      "payment_id": null,
      "paid_at": null
    },
    {
      "id": "37e4ed54-6502-42c6-a8fe-319002aa1cd1",
      "status": "initiated",
      "amount": 7000,
      "currency": "SAR",
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/37e4ed54-6502-42c6-a8fe-319002aa1cd1?lang=en",
      "callback_url": "http://www.example.com/payment_callback",
      "expired_at": null,
      "created_at": "2019-01-27T15:14:13.652Z",
      "updated_at": "2019-01-27T15:14:13.652Z",
      "payment_id": null,
      "paid_at": null
    },
    {
      "id": "86b2716e-eee1-43f2-8488-b27436477c54",
      "status": "initiated",
      "amount": 7000,
      "currency": "SAR",
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/86b2716e-eee1-43f2-8488-b27436477c54?lang=en",
      "callback_url": "http://www.example.com/payment_callback",
      "expired_at": null,
      "created_at": "2019-01-27T15:14:12.942Z",
      "updated_at": "2019-01-27T15:14:12.942Z",
      "payment_id": null,
      "paid_at": null
    },
    {
      "id": "d4bb1113-4d75-400a-9d08-2b99f7dc5055",
      "status": "initiated",
      "amount": 7000,
      "currency": "SAR",
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/d4bb1113-4d75-400a-9d08-2b99f7dc5055?lang=en",
      "callback_url": "http://www.example.com/payment_callback",
      "expired_at": null,
      "created_at": "2019-01-27T15:14:11.992Z",
      "updated_at": "2019-01-27T15:14:11.992Z",
      "payment_id": null,
      "paid_at": null
    },
    {
      "id": "ec58a4c8-5a58-49e5-9426-53fd38c6b183",
      "status": "initiated",
      "amount": 7000,
      "currency": "SAR",
      "description": "Food Delivery Payment",
      "amount_format": "70.00 SAR",
      "url": "https://dashboard.moyasar.com/invoices/ec58a4c8-5a58-49e5-9426-53fd38c6b183?lang=en",
      "callback_url": "http://www.example.com/payment_callback",
      "expired_at": null,
      "created_at": "2019-01-27T15:14:10.961Z",
      "updated_at": "2019-01-27T15:14:10.961Z",
      "payment_id": null,
      "paid_at": null
    }
  ],
  "meta": {
    "current_page": 1,
    "next_page": 2,
    "prev_page": null,
    "total_pages": 2,
    "total_count": 36
  }
}